{
  "main": {
    "name":"Hari Setiawan",
    "header": "I'm Hari",
    "description":"I am a freelance developer currently residing in South Korea",
    "image":"profpic.webp",
    "bio":"I am a quick to learn person and willing to discover and accept new ideas. I got my CS degree in Indonesia, then I got my Master degree in Pusan National University recently. I have worked as software engineer in different places for six years. Mostly I used PHP framework such as Laravel and Codeigniter. I also work with C++ to develop a desktop apps. In spare time, I like to create some utility tools for my own daily purposes using Python or Javascript. Currently, I am focused on learning React Native to develop a cross platform apps. Additionally, I'm also interested to work with Web 3.0 technology especially Blockchain (e.g: Smart contract, Bitcoin)",
    "contactmessage":"If you have any inquiry you can contact me by email",
    "email": "haristw16@gmail.com",
    "phone": "555-555-5555",
    "github":"https://github.com/harisw",
    "project":"https://github.com/harisw",
    "address":{
      "street":"",
      "city":"Busan, South Korea",
      "state":"",
      "zip": ""
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/hari-setiawan/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/harisw",
        "className":"fa fa-github"
      },
      {
        "name":"stackoverflow",
        "url":"https://stackoverflow.com/users/8252588/hari-setiawan",
        "className":"fa fa-stack-overflow"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Pusan National University",
        "degree":"Master in Computer Engineering",
        "graduated":"February 2022",
        "description":"While here, I spent most of my time learning database system and blockchain (Solidity and Hyperledger fabric). Since then, I am looking forward to utilize the blockchain's nature which are secure and decentralized. Under the supervision and guidance of my Professor, I was working to develop several project in C++. These projects are including but not limited to vessel simulation and rule engine visualization desktop application."
      },
      {
        "school":"Sepuluh Nopember Institute of Technology",
        "degree":"Bachelor in Computer Science",
        "graduated":"September 2018",
        "description":"Here I found my passion to dive into the software engineering path. I studied a lot about a good database design, the importance of fault-tolerance database, etc. I finished my thesis with a topic about emotion recognition from text using ensemble method."
      }
    ],
    "work":[
      {
        "company":"Medify.id",
        "title":"Software Engineer",
        "years":"September 2017 - March 2020",
        "description":"I gained most of my development experience here, since I had joined Medify.id from the beginning as a startup company. I worked to develop a hospital information system from the bottom using Laravel with my team. Since Medify.id focuses on medical field system, I had to built an API system to receive the data provided by laboratorium devices. I also had the chance to developed the API using Node.js for the mobile application."
      },
      {
        "company":"KASKUS Networks",
        "title":"Software Engineer Internship",
        "years":"June 2017 - August 2017",
        "description":"Working for a mature startup company gave me a big insight about being a software engineer. Here, I gained a chance to develop an HTML email template generator that can adapt to various marketing requirement using Codeigniter. I also learn how a continuous integration and deployment are used, so the company website can continuously serving while adding new features. Jenkins, containerization, and testing working together to make continuous integration possible."
      },
      {
        "company":"Dapatbuku",
        "title":"Web Developer",
        "years":"October 2015 - April 2016",
        "description":"Here, I learned for the first time how to build a real-world project. I built a startup website for online book rental using Codeigniter framework."
      }
    ],
    "skills":[
      {
        "name":"Javascript (React, React Native, Node.js)",
        "level":"70%",
        "content": "Due to the technology these days, I have been using Javascript both in frontend and backend. In my early days, I mostly used Javascript to provide the interaction in the website. Later, I've been using Node.js with Express framework to built a reliable API accompanied with React as its frontend. Nowadays, I'm looking to improve my skill by using React Native to develop a mobile apps."
      },
      {
        "name":"PHP (Laravel, Codeigniter, Native)",
        "level":"75%"
      },
      {
        "name":"C++ (Desktop Application, MFC)",
        "level":"50%"
      },
      {
        "name":"Python (Scikit, Numpy, etc)",
        "level":"50%"
      },
      {
        "name":"Blockchain (Solidity)",
        "level":"50%"
      }
    ]
  }
}